<template>
  <div>
    <section>
      <h2>Introduction</h2>
      <p>
        本项目是浙江大学2023学年《软件工程管理》课程的课程项目，目标是实现一个书籍垂直搜索引擎。
      </p>
      <p>
        随着互联网的发展，人们获取信息的方式发生了巨大的变化。特别是在图书领域，读者需要更加高效和便捷地获取他们感兴趣的书籍信息。传统的搜索引擎虽然可以提供大量的信息，但是在特定领域的深度搜索和精准推荐方面仍然存在不足。因此，开发一款专注于书籍领域的垂直搜索引擎成为了当下的需求。
        该书籍垂直搜索引擎项目旨在为读者提供一个专注于书籍的搜索平台，通过整合各种图书信息资源，包括线上线下书店、图书馆、电子书平台等，为用户提供更加全面、深入的书籍搜索和推荐服务。这将有助于读者更快速、更准确地找到他们感兴趣的书籍，推动图书行业的数字化和信息化发展。
        项目团队将致力于开发一款功能强大、用户体验友好的书籍垂直搜索引擎，通过技术手段提高图书信息的获取效率，为用户提供更加便捷的阅读体验。同时，该搜索引擎还将为图书出版商、书店和图书馆等机构提供更广泛的推广和宣传渠道，促进图书产业的发展和繁荣。
        书籍垂直搜索引擎项目的开发将填补当前书籍领域搜索服务的空白，满足用户对于高效获取图书信息的需求，促进图书产业的数字化和信息化发展。
      </p>
    </section>
    <section>
      <h2>Our Team</h2>
      <ul>
        <li>王伟杰</li>
        <li>陈华杰</li>
        <li>刘逸杰</li>
        <li>黄乐诚</li>
        <li>包越</li>
        <li>安俊霖</li>
      </ul>
    </section>
    <section>
      <h2>Contact Us</h2>
      <p>Email: software@zju.edu.cn<br /></p>
      <p>Phone: 123-456-7890<br /></p>
      <p>Address: 浙江大学玉泉校区<br /></p>
    </section>
  </div>
</template>
